In [1]:
import pandas as pd

## Series

### 1Series的定义

In [2]:
s1=pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
s2=pd.Series([10,20,30,40],index=['a','b','c','d'])
s2

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
s3=pd.Series({"Alice":100,"Bob":90,"Charlie":80})
print(s3)

Alice      100
Bob         90
Charlie     80
dtype: int64

### 2Series的基本操作

In [5]:
s3=pd.Series({"Alice":100,"Bob":90,"Charlie":80})

print("索引:",s3.index)
print("数据:",s3.values)
print("类型:",s3.dtype)
print("形状:",s3.shape)

索引: Index(['Alice', 'Bob', 'Charlie'], dtype='object')
数据: [100  90  80]
类型: int64
形状: (3,)

In [6]:
s3=pd.Series({"Alice":100,"Bob":90,"Charlie":80})
print("Alice的成绩是:",s3["Alice"])
for name,score in s3.items():
    print(name,score)

Alice的成绩是: 100
Alice 100
Bob 90
Charlie 80

In [7]:
s4={
    "name":["Alice","Bob","Charlie","David"],
    "age":[20,21,22,23],
    "score":[80,81,82,83],
    "gender":["F","M","M","M"]
}
df=pd.DataFrame(s4)#将字典s4转换为DataFrame
df

      name  age  score gender
0    Alice   20     80      F
1      Bob   21     81      M
2  Charlie   22     82      M
3    David   23     83      M

In [8]:
df=pd.DataFrame(s4,index=['a','b','c','d'])#横坐标columns=['A','B','C','D']
df

      name  age  score gender
a    Alice   20     80      F
b      Bob   21     81      M
c  Charlie   22     82      M
d    David   23     83      M

In [9]:
print(df.index)#行索引
print(df.columns)#列索引
print(df.values)#数组

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['name', 'age', 'score', 'gender'], dtype='object')
[['Alice' 20 80 'F']
 ['Bob' 21 81 'M']
 ['Charlie' 22 82 'M']
 ['David' 23 83 'M']]

In [10]:
# path='GB_video_data_bunber.csv'
# df2=pd.read_csv(path)
# df2

### 3Series索引操作

In [11]:
s2=pd.Series(['A','B','C','D'],index=['001','002','003','004'])
s2

001    A
002    B
003    C
004    D
dtype: object

In [12]:
s2.loc['002']#获取索引为002的元素

'B'

In [13]:
s2.iloc[1]#获取第2个元素

'B'

In [14]:
print("loc左闭右闭:\n",s2.loc['002':'004'])#通过索引取值[左闭右闭]
print('-'*30)
print("iloc左闭右开:\n",s2.iloc[0:2])#通过索引位置取值[左闭右开]

loc左闭右闭:
 002    B
003    C
004    D
dtype: object
------------------------------
iloc左闭右开:
 001    A
002    B
dtype: object

### 4.2DataFrame索引

In [ ]:
import pandas as pd
import numpy as np

In [19]:
df=pd.DataFrame(np.arange(12).reshape(3,4),index=['s1','s2','s3'],columns=['c1','c2','c3','c4'])
df

    c1  c2  c3  c4
s1   0   1   2   3
s2   4   5   6   7
s3   8   9  10  11

In [22]:
print("原始数据:")
print(df)
print("*"*50)
#1.通过列索引获得取值
print("1.通过列索引获得取值:")
print(df['c1'])
print("*"*50)
#2.通过列索引获得多个取值
print("2.通过列索引获得多个取值:")
print(df[['c1','c2']])
print("*"*50)
#3.通过行索引获得取值
print("3.通过行索引获得取值:")
print(df.loc['s2'])
#4.通过行索引获得多个取值
print("4.通过行索引获得多个取值:")
print(df.loc[['s1','s2']])

原始数据:
    c1  c2  c3  c4
s1   0   1   2   3
s2   4   5   6   7
s3   8   9  10  11
**************************************************
1.通过列索引获得取值:
s1    0
s2    4
s3    8
Name: c1, dtype: int64
**************************************************
2.通过列索引获得多个取值:
    c1  c2
s1   0   1
s2   4   5
s3   8   9
**************************************************
3.通过行索引获得取值:
c1    4
c2    5
c3    6
c4    7
Name: s2, dtype: int64
4.通过行索引获得多个取值:
    c1  c2  c3  c4
s1   0   1   2   3
s2   4   5   6   7

In [24]:
#5.通过位置索引获得取值
print("5.通过位置索引获得取值:")
print(df.iloc[0])
print("*"*50)

#6.通过位置索引获得多个取值
print("6.通过位置索引获得多个取值:")
print(df.iloc[[0,2]])
print("*"*50)

#7.获取具体位置取值
print("7.获取具体位置取值:")
print(df.iloc[1,2])

5.通过位置索引获得取值:
c1    0
c2    1
c3    2
c4    3
Name: s1, dtype: int64
**************************************************
6.通过位置索引获得多个取值:
    c1  c2  c3  c4
s1   0   1   2   3
s3   8   9  10  11
**************************************************
7.获取具体位置取值:
6

In [27]:
#8.通过位置索引切片获取数据
print("8.通过位置索引切片获取数据:")
print(df.iloc[0:2,1:3])
print("*"*50)
#9.通过名字索引切片获取数据
print("9.通过名字索引切片获取数据:")
print(df.loc['s1':'s2','c1':'c2'])
print("*"*50)
#10.一次取多个不连续的行或列
print("10.一次取多个不连续的行或列:")
print(df.iloc[[0,2],[1,3]])#前面是行索引，后面是列索引
print("或")
print(df.loc[['s1','s2'],['c1','c2']])

8.通过位置索引切片获取数据:
    c2  c3
s1   1   2
s2   5   6
**************************************************
9.通过名字索引切片获取数据:
    c1  c2
s1   0   1
s2   4   5
**************************************************
10.一次取多个不连续的行或列:
    c2  c4
s1   1   3
s3   9  11
或
    c1  c2
s1   0   1
s2   4   5

### 4.3 检测重复值

In [41]:
data={
    "name":["Alice","Bob","Charlie","David","Alice","Charlie"],
    "age":[25,30,35,40,25,35],
    "score":[80,85,90,95,80,85],
    "gender":["F","M","M","F","F","M"]
    
}

In [42]:
df=pd.DataFrame(data,index=["s1","s2","s3","s4","s5","s6"],columns=["name","age","score","gender"])
df

       name  age  score gender
s1    Alice   25     80      F
s2      Bob   30     85      M
s3  Charlie   35     90      M
s4    David   40     95      F
s5    Alice   25     80      F
s6  Charlie   35     85      M

In [43]:
#1.检测重复值
print("1.检测重复值:")
print(df.duplicated())
print("*"*50)
print("True表示重复值")

1.检测重复值:
s1    False
s2    False
s3    False
s4    False
s5     True
s6    False
dtype: bool
**************************************************
True表示重复值

In [44]:
#2.指定列检测重复值
print("2.指定列检测重复值:")
print(df.duplicated(subset=["name","age"]))#根据name和age列检测重复值
print("*"*50)
print("True表示重复值")

2.指定列检测重复值:
s1    False
s2    False
s3    False
s4    False
s5     True
s6     True
dtype: bool
**************************************************
True表示重复值

In [47]:
#3.删除重复值
print("3.删除重复值:")
print(df.drop_duplicates(inplace=True))#inplace=True表示在原数据上操作
print("*"*50)
print("删除重复值后:")
df

3.删除重复值:
None
**************************************************
删除重复值后:

       name  age  score gender
s1    Alice   25     80      F
s2      Bob   30     85      M
s3  Charlie   35     90      M
s4    David   40     95      F
s6  Charlie   35     85      M

### 4.4 缺失值处理

In [63]:
data={
    "name":["Alice","Bob","Charlie","David","Alice","Charlie"],
    "age":[25,30,35,40,25,np.nan],
    "score":[80,np.nan,90,95,80,np.nan],
    "gender":["F","M","M",np.nan,np.nan,np.nan]
}
df=pd.DataFrame(data,index=["s1","s2","s3","s4","s5","s6"],columns=["name","age","score","gender"])
df

       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    NaN      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0    NaN
s5    Alice  25.0   80.0    NaN
s6  Charlie   NaN    NaN    NaN

In [64]:
print("检测缺失值:")
print("True表示缺失值")
print(df.isnull())
print("*"*50)
#计算缺失值的数量
print(df.isnull().sum())
print("*"*50)
#每一行的缺失值数量
print(df.isnull().sum(axis=1))
print("*"*50)
#每一列的缺失值数量
print(df.isnull().sum(axis=0))

检测缺失值:
True表示缺失值
     name    age  score  gender
s1  False  False  False   False
s2  False  False   True   False
s3  False  False  False   False
s4  False  False  False    True
s5  False  False  False    True
s6  False   True   True    True
**************************************************
name      0
age       1
score     2
gender    3
dtype: int64
**************************************************
s1    0
s2    1
s3    0
s4    1
s5    1
s6    3
dtype: int64
**************************************************
name      0
age       1
score     2
gender    3
dtype: int64

In [65]:
#计算每一列的缺失值比例
print(df.isnull().mean(axis=0))
print("*"*50)

#计算每一行的缺失值比例
print(df.isnull().mean(axis=1))

name      0.000000
age       0.166667
score     0.333333
gender    0.500000
dtype: float64
**************************************************
s1    0.00
s2    0.25
s3    0.00
s4    0.25
s5    0.25
s6    0.75
dtype: float64

In [66]:
#每一列缺失率
print(df.isnull().sum()/len(df))
#每一行缺失率
print(df.isnull().sum(axis=1)/df.shape[1])

name      0.000000
age       0.166667
score     0.333333
gender    0.500000
dtype: float64
s1    0.00
s2    0.25
s3    0.00
s4    0.25
s5    0.25
s6    0.75
dtype: float64

In [67]:
# 删除缺失值
print(df)

       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    NaN      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0    NaN
s5    Alice  25.0   80.0    NaN
s6  Charlie   NaN    NaN    NaN

In [ ]:
#2.删除所有缺失值的行或列(谨慎操作,可能会丢失大量数据)
print(df.dropna())

       name   age  score gender
s1    Alice  25.0   80.0      F
s3  Charlie  35.0   90.0      M

In [ ]:
#3.删除所含缺失值的列
print("删除所含缺失值的列")
print(df.dropna(axis=1))
print('-'*30)
#4.删除所有缺失值的行
print("删除所有缺失值的行")
print(df.dropna())
print('-'*30)

# 5.删除指定列缺失值的行
df_drop_by_col=df.dropna(subset=["gender"])
print("删除gender列缺失值的行")
print(df_drop_by_col)

删除所含缺失值的列
       name
s1    Alice
s2      Bob
s3  Charlie
s4    David
s5    Alice
s6  Charlie
------------------------------
删除所有缺失值的行
       name   age  score gender
s1    Alice  25.0   80.0      F
s3  Charlie  35.0   90.0      M
------------------------------
删除gender列缺失值的行
       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    NaN      M
s3  Charlie  35.0   90.0      M

In [79]:
#填充缺失值
print(df)
#1.填充全局缺失值,填充缺失值为0
df_fill_na=df.fillna(0)
print("填充缺失值为0")
print(df_fill_na)
print('-'*30)

#2. 填充指定列缺失值
df_fill_na_col=df.fillna({"age":0,"score":0})
print("填充age列缺失值为0,score列缺失值为0")
print(df_fill_na_col)
print('-'*30)

#3.单独把某列取出来,填充缺失值为80
df["age"]=df["age"].fillna(80)
print("单独把age列取出来,填充age列缺失值为80")
print(df)
print('-'*30)

       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    NaN      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0    NaN
s5    Alice  25.0   80.0    NaN
s6  Charlie   NaN    NaN    NaN
填充缺失值为0
       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    0.0      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0      0
s5    Alice  25.0   80.0      0
s6  Charlie   0.0    0.0      0
------------------------------
填充age列缺失值为0,score列缺失值为0
       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    0.0      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0    NaN
s5    Alice  25.0   80.0    NaN
s6  Charlie   0.0    0.0    NaN
------------------------------
单独把age列取出来,填充age列缺失值为80
       name   age  score gender
s1    Alice  25.0   80.0      F
s2      Bob  30.0    NaN      M
s3  Charlie  35.0   90.0      M
s4    David  40.0   95.0    NaN
s5    Alice  25.0   80.0    NaN
s6  Charlie  80.0    NaN    NaN
------------------------------